Octopustank/stm32-multifunction-embedded-toy/Core/Src/main.c
/*
 * main.c - Application entry (runs as RT-Thread main thread)
 *
 * Architecture (Blackboard Pattern):
 *   sensor_thread (prio 8)  → sensor_data (mutex) ← oled_thread (prio 12)
 *                                   ↕ semaphore
 *
 *   shell / MQTT           → face_mode (mutex)  ← game_thread (prio 9)
 *     (producer)                                    (consumer: MAX7219 + LEDs)
 *
 * Startup flow:
 *   startup.s → entry() → rtthread_startup() → main()
 */
#include <rtthread.h>
#include <stdio.h>
#include <string.h>
#include "main.h"
#include "gpio.h"
#include "i2c.h"
#include "ssd1306.h"
#include "dht11.h"
#include "adc.h"
#include "tim.h"
#include "HCSR04.h"
#include "usart.h"
#include "esp8266_mqtt.h"
#include "max7219.h"
#include "snake.h"
#include "net_auto_config.h"

/* ---- LED Definitions ----------------------------------------------------- */

typedef struct {
    GPIO_TypeDef *port;
    uint16_t      pin;
} LED_t;

static const LED_t leds[] = {
    {GPIOB, LED1_Pin},
    {GPIOB, LED2_Pin},
    {GPIOB, LED3_Pin},
    {LED4_GPIO_Port, LED4_Pin},
};
#define LED_NUM    (sizeof(leds) / sizeof(leds[0]))

#define LED_ON    GPIO_PIN_RESET
#define LED_OFF   GPIO_PIN_SET

/* ---- Sensor Data (Blackboard) -------------------------------------------- */

struct SensorData {
    float    temp;
    float    humi;
    uint16_t light;
    uint16_t distance;   /* cm, SR04 */
    uint8_t  is_valid;   /* 1=OK, 0=stale, 2=hw fault */
};

static struct SensorData     sensor_data;
static struct rt_mutex       sensor_mutex;
static struct rt_mutex       i2c_mutex;
static struct rt_semaphore   sensor_sem;   /* notify OLED consumer */

/* ---- Face Blackboard ------------------------------------------------------ */

#define FACE_IDLE   0
#define FACE_THINK  1
#define FACE_HAPPY  2
#define FACE_SAD    3

static int         face_mode = FACE_IDLE;
static struct rt_mutex face_mutex;

/* ---- Game State ---------------------------------------------------------- */

static int         game_mode;   /* 0=idle, 1=playing, 2=dead */
static snake_dir_t g_dir;       /* input from key thread */
static int         g_serial_snake; /* serial input mode */

/* ---- MQTT State ---------------------------------------------------------- */

static char mqtt_ssid[32], mqtt_pwd[32];
static char mqtt_broker[32], mqtt_port[8], mqtt_client[32];
static char mqtt_topic[48];
static char mqtt_sub0[48];
static int  mqtt_connected;
static int  mqtt_sub0_active;
static volatile int esp_cmd, esp_result;
static struct rt_semaphore esp_go_sem;
static struct rt_semaphore esp_done_sem;

static int        autopub_enabled = AUTO_PUB_ENABLE;
#if AUTO_SUB_ECHO
static int        sub_echo = AUTO_SUB_ECHO;
#if AUTO_SUB_EXEC
static int        sub_exec = AUTO_SUB_EXEC;
#endif
#endif
static rt_tick_t  last_autopub;

/* ---- Forward Declarations ------------------------------------------------ */

static void key_thread_entry(void *param);
static void sensor_thread_entry(void *param);
static void oled_thread_entry(void *param);
static void shell_thread_entry(void *param);
static void esp_thread_entry(void *param);
static void game_thread_entry(void *param);

/* ---- Helpers ------------------------------------------------------------- */

static void all_leds_off(void)
{
    for (uint8_t i = 0; i < LED_NUM; i++)
        HAL_GPIO_WritePin(leds[i].port, leds[i].pin, LED_OFF);
}

/*
 * Non-blocking key-press detector (falling-edge with debounce).
 * Does NOT wait for release — other keys remain responsive.
 */
static rt_bool_t key_pressed(GPIO_TypeDef *port, uint16_t pin)
{
    static uint8_t prev[5];
    uint8_t idx;

    if      (port == K1_LEFT_GPIO_Port   && pin == K1_LEFT_Pin)   idx = 0;
    else if (port == K2_RIGHT_GPIO_Port  && pin == K2_RIGHT_Pin)  idx = 1;
    else if (port == K3_UP_GPIO_Port     && pin == K3_UP_Pin)     idx = 2;
    else if (port == K4_DOWN_GPIO_Port   && pin == K4_DOWN_Pin)   idx = 3;
    else if (port == K5_CENTER_GPIO_Port && pin == K5_CENTER_Pin) idx = 4;
    else return RT_FALSE;

    uint8_t cur = (HAL_GPIO_ReadPin(port, pin) == GPIO_PIN_RESET) ? 1 : 0;
    if (cur && !prev[idx]) {
        rt_thread_mdelay(20);
        if (HAL_GPIO_ReadPin(port, pin) == GPIO_PIN_RESET) {
            prev[idx] = 1;
            return RT_TRUE;
        }
    }
    if (!cur) prev[idx] = 0;
    return RT_FALSE;
}

static void all_leds_on(void)
{
    for (uint8_t i = 0; i < LED_NUM; i++)
        HAL_GPIO_WritePin(leds[i].port, leds[i].pin, LED_ON);
}

/* ---- Key Thread (prio 10) ------------------------------------------------ */

static void key_thread_entry(void *param)
{
    while (1) {
        /* ---- game-mode keys ---- */
        if (game_mode == 1) {
            if (key_pressed(K1_LEFT_GPIO_Port,  K1_LEFT_Pin))  g_dir = DIR_LEFT;
            if (key_pressed(K2_RIGHT_GPIO_Port, K2_RIGHT_Pin)) g_dir = DIR_RIGHT;
            if (key_pressed(K3_UP_GPIO_Port,    K3_UP_Pin))    g_dir = DIR_UP;
            if (key_pressed(K4_DOWN_GPIO_Port,  K4_DOWN_Pin))  g_dir = DIR_DOWN;
            if (key_pressed(K5_CENTER_GPIO_Port, K5_CENTER_Pin)) game_mode = 0;
            rt_thread_mdelay(10);
            continue;
        }
        if (game_mode == 2) {
            if (key_pressed(K3_UP_GPIO_Port, K3_UP_Pin))
                { snake_init(); game_mode = 1; }
            if (key_pressed(K5_CENTER_GPIO_Port, K5_CENTER_Pin))
                game_mode = 0;
            rt_thread_mdelay(10);
            continue;
        }

        /* ---- normal-mode keys ---- */
        if (key_pressed(K3_UP_GPIO_Port, K3_UP_Pin))
            { game_mode = 1; snake_init(); g_serial_snake = 1; continue; }
        rt_thread_mdelay(10);
    }
}

/* ---- Sensor Thread (producer, prio 8) ------------------------------------ */

static void sensor_thread_entry(void *param)
{
    float temp, humi;
    static float last_temp, last_humi;
    static uint8_t fail_count;

    rt_thread_mdelay(2000);   /* DHT11 warm-up */

    while (1) {
        uint8_t result = DHT11_READ_DATA(&temp, &humi);
        uint16_t light = adc_read();
        HCSR_04();
        float dist = getSR04Distance();
        uint16_t distance = (dist > 0 && dist < 4000) ? (uint16_t)(dist + 0.5f) : 0;

        rt_mutex_take(&sensor_mutex, RT_WAITING_FOREVER);
        sensor_data.light    = light;
        sensor_data.distance = distance;

        if (result == 1) {
            last_temp  = temp;
            last_humi  = humi;
            fail_count = 0;
            sensor_data.temp     = temp;
            sensor_data.humi     = humi;
            sensor_data.is_valid = 1;
        } else {
            fail_count++;
            sensor_data.temp     = last_temp;
            sensor_data.humi     = last_humi;
            sensor_data.is_valid = (fail_count > 10) ? 2 : 0;
        }
        rt_mutex_release(&sensor_mutex);

        rt_sem_release(&sensor_sem);
        rt_thread_mdelay(800);
    }
}

/* ---- OLED Thread (consumer, prio 12) ------------------------------------- */

static void oled_thread_entry(void *param)
{
    char line1[48], line2[24], line3[16], line4[24];
    rt_thread_mdelay(2000);

    while (1) {
        rt_sem_take(&sensor_sem, RT_WAITING_FOREVER);

        rt_mutex_take(&sensor_mutex, RT_WAITING_FOREVER);
        struct SensorData local = sensor_data;
        rt_mutex_release(&sensor_mutex);

