Octopustank/stm32-multifunction-embedded-toy/Core/Src/main.c
        if (local.is_valid == 1) {
            int t_i = (int)local.temp, t_d = (int)((local.temp - t_i) * 10 + 0.5f);
            int h_i = (int)local.humi, h_d = (int)((local.humi - h_i) * 10 + 0.5f);
            if (t_d >= 10) { t_i++; t_d -= 10; }
            if (h_d >= 10) { h_i++; h_d -= 10; }
            snprintf(line1, sizeof(line1), "T:%d.%dC H:%d.%d%%", t_i, t_d, h_i, h_d);
        } else if (local.is_valid == 0) {
            snprintf(line1, sizeof(line1), "reading...");
        } else {
            snprintf(line1, sizeof(line1), "DHT11 fault!");
        }
        snprintf(line2, sizeof(line2), "L:%u D:%ucm", local.light, local.distance);

        snprintf(line3, sizeof(line3), "W:%s M:%s",
            mqtt_connected >= 1 ? "OK" : (mqtt_connected < 0 ? "ER" : "--"),
            mqtt_connected == 2 ? "OK" : (mqtt_connected < -1 ? "ER" : "--"));

        if (mqtt_sub0_active && mqtt_sub0[0])
            snprintf(line4, sizeof(line4), "%.18s", mqtt_sub0);
        else
            snprintf(line4, sizeof(line4), "Sub: --");

        rt_mutex_take(&i2c_mutex, RT_WAITING_FOREVER);
        ssd1306_Fill(Black);
        ssd1306_SetCursor(0, 0);
        ssd1306_WriteString(line1, Font_7x10, White);
        ssd1306_SetCursor(0, 16);
        ssd1306_WriteString(line2, Font_7x10, White);
        ssd1306_SetCursor(0, 32);
        ssd1306_WriteString(line3, Font_7x10, White);
        ssd1306_SetCursor(0, 48);
        ssd1306_WriteString(line4, Font_7x10, White);
        ssd1306_UpdateScreen(&hi2c1);
        rt_mutex_release(&i2c_mutex);
    }
}

/* ---- Shell Thread (UART command parser with history) -------------------- */

#define HIST_SIZE  4
#define HIST_LEN   24
#define CMD_BUF    24

static void shell_thread_entry(void *param)
{
    static char cmd[CMD_BUF], history[HIST_SIZE][HIST_LEN];
    static int  hist_wr, hist_cnt, hist_cur;
    static uint8_t pos, esc_state;
    char buf[64];

    uart_puts("\r\n \\ | /\r\n");
    uart_puts("- RT -     Thread Operating System\r\n");
    snprintf(buf, sizeof(buf), " / | \\     %d.%d.%d build %s %s\r\n",
             RT_VERSION, RT_SUBVERSION, RT_REVISION, __DATE__, __TIME__);
    uart_puts(buf);
    uart_puts(" 2006 - 2022 Copyright by RT-Thread team\r\n\r\n");
    uart_puts("rtt> ");

    while (1) {
        /* yield UART to game thread during serial snake */
        if (game_mode == 1 && g_serial_snake) {
            rt_thread_mdelay(50);
            continue;
        }

        int c = uart_getc();
        if (c < 0) { rt_thread_mdelay(10); continue; }

        /* ---- ESC sequence parser (arrow keys) ---- */
        if (esc_state == 0 && c == 0x1B)      { esc_state = 1; continue; }
        if (esc_state == 1) {
            esc_state = (c == '[') ? 2 : 0;
            continue;
        }
        if (esc_state == 2) {
            esc_state = 0;

            if (c == 'A') {     /* UP: browse older history */
                if (hist_cnt == 0) continue;
                if (hist_cur < hist_cnt) {
                    /* save current input if at bottom */
                    if (hist_cur == 0) memcpy(history[hist_wr], cmd, pos + 1);

                    hist_cur++;
                    int idx = (hist_wr - hist_cur + HIST_SIZE) % HIST_SIZE;
                    /* clear line, show recalled command */
                    while (pos--) uart_puts("\b \b");
                    uart_puts(history[idx]);
                    strcpy(cmd, history[idx]);
                    pos = strlen(cmd);
                }
                continue;
            }
            if (c == 'B') {     /* DOWN: browse newer history */
                if (hist_cur == 0) continue;
                hist_cur--;
                /* clear line */
                while (pos--) uart_puts("\b \b");
                if (hist_cur == 0) {
                    cmd[0] = '\0'; pos = 0; /* bottom: restore current input */
                    memcpy(cmd, history[hist_wr], HIST_LEN);
                    cmd[HIST_LEN-1] = '\0';
                    pos = strlen(cmd);
                    uart_puts(cmd);
                } else {
                    int idx = (hist_wr - hist_cur + HIST_SIZE) % HIST_SIZE;
                    uart_puts(history[idx]);
                    strcpy(cmd, history[idx]);
                    pos = strlen(cmd);
                }
                continue;
            }
            /* other CSI keys: ignore */
            continue;
        }

        /* ---- Backspace ---- */
        if (c == '\b' || c == 127) {
            if (pos > 0) { uart_puts("\b \b"); pos--; cmd[pos] = '\0'; }
            continue;
        }

        /* ---- Echo printable ---- */
        uart_putc((char)c);

        /* ---- Enter: execute ---- */
        if (c == '\r' || c == '\n') {
            cmd[pos] = '\0';
            uart_puts("\r\n");

            if (pos == 0) goto prompt;

            /* save to history (skip duplicates) */
            if (hist_cnt == 0 || strcmp(cmd, history[(hist_wr - 1 + HIST_SIZE) % HIST_SIZE])) {
                strncpy(history[hist_wr], cmd, HIST_LEN - 1);
                history[hist_wr][HIST_LEN - 1] = '\0';
                hist_wr = (hist_wr + 1) % HIST_SIZE;
                if (hist_cnt < HIST_SIZE) hist_cnt++;
            }
            hist_cur = 0;

            /* ---- command dispatch ---- */
            if      (!strcmp(cmd, "help")) uart_puts("help stat snake happy sad think autopub subecho subexec\r\nwifi SSID PWD   mqtt IP PORT ID   connect   mqttconn\r\npub   sub TOPIC   unsub\r\n");
            else if (!strcmp(cmd, "stat")) {
                rt_mutex_take(&sensor_mutex, RT_WAITING_FOREVER);
                struct SensorData local = sensor_data;
                rt_mutex_release(&sensor_mutex);
                char buf[96];
                int ti = (int)local.temp, td = (int)((local.temp - ti) * 10 + 0.5f);
                int hi = (int)local.humi, hd = (int)((local.humi - hi) * 10 + 0.5f);

                snprintf(buf, sizeof(buf), "T:%d.%dC H:%d.%d%% L:%u D:%ucm ok:%d\r\n",
                    ti, td, hi, hd, local.light, local.distance, local.is_valid);
                uart_puts(buf);

