Octopustank/stm32-multifunction-embedded-toy/Core/Src/main.c
                snprintf(buf, sizeof(buf), "WiFi:%.24s (%s)  MQTT:%.16s:%.6s %.24s (%s)\r\n",
                    mqtt_ssid[0] ? mqtt_ssid : "-",
                    mqtt_connected>=1 ? "OK" : (mqtt_connected==-1 ? "FAIL" : "--"),
                    mqtt_broker[0] ? mqtt_broker : "-",
                    mqtt_port,
                    mqtt_client[0] ? mqtt_client : "-",
                    mqtt_connected==2 ? "OK" : (mqtt_connected==-2 ? "FAIL" : "--"));
                uart_puts(buf);

                snprintf(buf, sizeof(buf), "Sub:%.48s\r\n",
                    mqtt_sub0_active ? mqtt_sub0 : "-");
                uart_puts(buf);

                snprintf(buf, sizeof(buf), "apub:%d"
#if AUTO_SUB_ECHO
                    " echo:%d"
#endif
#if AUTO_SUB_EXEC
                    " exec:%d"
#endif
                    "\r\n",
                    autopub_enabled
#if AUTO_SUB_ECHO
                    , sub_echo
#endif
#if AUTO_SUB_EXEC
                    , sub_exec
#endif
                    );
                uart_puts(buf);
            }
            else if (!strcmp(cmd, "autopub")) {
                autopub_enabled = !autopub_enabled;
                uart_puts(autopub_enabled ? "autopub ON\r\n" : "autopub OFF\r\n");
            }
#if AUTO_SUB_ECHO
            else if (!strcmp(cmd, "subecho")) {
                sub_echo = !sub_echo;
                uart_puts(sub_echo ? "subecho ON\r\n" : "subecho OFF\r\n");
            }
#if AUTO_SUB_EXEC
            else if (!strcmp(cmd, "subexec")) {
                sub_exec = !sub_exec;
                uart_puts(sub_exec ? "subexec ON\r\n" : "subexec OFF\r\n");
            }
#endif
#endif
            else if (!strcmp(cmd, "happy"))  { rt_mutex_take(&face_mutex, RT_WAITING_FOREVER); face_mode = FACE_HAPPY; rt_mutex_release(&face_mutex); uart_puts("face:happy\r\n"); }
            else if (!strcmp(cmd, "sad"))    { rt_mutex_take(&face_mutex, RT_WAITING_FOREVER); face_mode = FACE_SAD;   rt_mutex_release(&face_mutex); uart_puts("face:sad\r\n"); }
            else if (!strcmp(cmd, "think"))  { rt_mutex_take(&face_mutex, RT_WAITING_FOREVER); face_mode = FACE_THINK; rt_mutex_release(&face_mutex); uart_puts("face:think\r\n"); }
            else if (!strcmp(cmd, "snake"))  { snake_init(); game_mode = 1; g_serial_snake = 1; while (uart_getc() >= 0) {} uart_puts("WASD=move Enter=end Ctrl+C=abort\r\n"); }
            else if (!strncmp(cmd, "wifi ", 5)) {
                char *sp = strchr(cmd + 5, ' ');
                if (!sp) { uart_puts("usage: wifi SSID PWD\r\n"); goto prompt; }
                *sp = '\0';
                strncpy(mqtt_ssid, cmd + 5, sizeof(mqtt_ssid) - 1);
                strncpy(mqtt_pwd, sp + 1, sizeof(mqtt_pwd) - 1);
                uart_puts("saved\r\n");
            }
            else if (!strcmp(cmd, "connect")) {
                uart_puts("Connecting WiFi...\r\n");
                esp_cmd = 1;
                rt_sem_release(&esp_go_sem);
                if (rt_sem_take(&esp_done_sem, 25000) == RT_EOK) {
                    if (esp_result == 0) uart_puts("WiFi connected!\r\n");
                    else { char b[48]; snprintf(b, sizeof(b), "WiFi fail %d\r\n", (int)esp_result); uart_puts(b); }
                } else uart_puts("WiFi timeout\r\n");
            }
            else if (!strncmp(cmd, "mqtt ", 5)) {
                char *p1 = strchr(cmd + 5, ' ');
                char *p2 = p1 ? strchr(p1 + 1, ' ') : NULL;
                if (!p1 || !p2) { uart_puts("usage: mqtt IP PORT ID\r\n"); goto prompt; }
                *p1 = '\0'; *p2 = '\0';
                strncpy(mqtt_broker, cmd + 5, sizeof(mqtt_broker) - 1);
                strncpy(mqtt_port,   p1 + 1, sizeof(mqtt_port) - 1);
                strncpy(mqtt_client, p2 + 1, sizeof(mqtt_client) - 1);
                uart_puts("saved\r\n");
            }
            else if (!strcmp(cmd, "mqttconn")) {
                uart_puts("Connecting MQTT...\r\n");
                esp_cmd = 2;
                rt_sem_release(&esp_go_sem);
                if (rt_sem_take(&esp_done_sem, 15000) == RT_EOK) {
                    if (esp_result == 0) uart_puts("MQTT connected!\r\n");
                    else { char b[48]; snprintf(b, sizeof(b), "MQTT fail %d\r\n", (int)esp_result); uart_puts(b); }
                } else uart_puts("MQTT timeout\r\n");
            }
            else if (!strcmp(cmd, "pub")) {
                esp_cmd = 3;
                rt_sem_release(&esp_go_sem);
                rt_sem_take(&esp_done_sem, 10000);
                uart_puts(esp_result == 0 ? "pub ok\r\n" : "pub fail\r\n");
            }
            else if (!strncmp(cmd, "test ", 5)) {
                esp_cmd = 7;
                strncpy(mqtt_topic, cmd + 5, sizeof(mqtt_topic) - 1);
                rt_sem_release(&esp_go_sem);
                rt_sem_take(&esp_done_sem, 10000);
                uart_puts(esp_result == 0 ? "test ok\r\n" : "test fail\r\n");
            }
            else if (!strncmp(cmd, "sub ", 4)) {
                strncpy(mqtt_topic, cmd + 4, sizeof(mqtt_topic) - 1);
                esp_cmd = 4;
                rt_sem_release(&esp_go_sem);
                if (rt_sem_take(&esp_done_sem, 10000) == RT_EOK && esp_result == 0) {
                    strncpy(mqtt_sub0, mqtt_topic, sizeof(mqtt_sub0) - 1);
                    mqtt_sub0_active = 1;
                    uart_puts("sub ok\r\n");
                } else uart_puts("sub fail\r\n");
            }
            else if (!strcmp(cmd, "unsub")) {
                strncpy(mqtt_topic, mqtt_sub0, sizeof(mqtt_topic) - 1);
                esp_cmd = 5;
                rt_sem_release(&esp_go_sem);
                if (rt_sem_take(&esp_done_sem, 10000) == RT_EOK && esp_result == 0) {
                    mqtt_sub0_active = 0;
                    uart_puts("unsub ok\r\n");
                } else uart_puts("unsub fail\r\n");
            }
            else { uart_puts("? try: help\r\n"); }

prompt:
            pos = 0;
            uart_puts("rtt> ");
        } else if (pos < CMD_BUF - 1) {
            cmd[pos++] = (char)c;
            cmd[pos] = '\0';
        }
    }
}

/* ---- ESP Thread (async WiFi/MQTT worker) --------------------------------- */

static void esp_thread_entry(void *param)
{
    while (1) {
        rt_err_t ret = rt_sem_take(&esp_go_sem, mqtt_connected == 2 ? 800 : RT_WAITING_FOREVER);
        if (ret != RT_EOK && mqtt_connected == 2) esp_cmd = 6;

        int cmd = esp_cmd;

