Octopustank/stm32-multifunction-embedded-toy/Core/Src/main.c
    MX_TIM4_Init();
    HAL_TIM_Base_Start_IT(&htim4);             /* start timer counter */
    HAL_TIM_IC_Start_IT(&htim4, TIM_CHANNEL_2);
    __HAL_TIM_ENABLE_IT(&htim4, TIM_IT_UPDATE);  /* overflow interrupt */

    /* kernel objects (static init — no heap frag) */
    rt_mutex_init(&sensor_mutex, "s_mtx", RT_IPC_FLAG_FIFO);
    rt_mutex_init(&i2c_mutex,    "i_mtx", RT_IPC_FLAG_FIFO);
    rt_sem_init(&sensor_sem, "s_sem", 0, RT_IPC_FLAG_FIFO);
    rt_sem_init(&esp_go_sem, "e_go",  0, RT_IPC_FLAG_FIFO);
    rt_sem_init(&esp_done_sem,"e_done",0, RT_IPC_FLAG_FIFO);
    rt_mutex_init(&face_mutex, "f_mtx", RT_IPC_FLAG_FIFO);

    /* splash screen */
    ssd1306_Fill(Black);
    /* border */
    for (uint8_t x = 0; x < 128; x++) {
        ssd1306_DrawPixel(x,  0, White);
        ssd1306_DrawPixel(x, 63, White);
    }
    for (uint8_t y = 0; y < 64; y++) {
        ssd1306_DrawPixel(0,   y, White);
        ssd1306_DrawPixel(127, y, White);
    }
    /* title */
    ssd1306_SetCursor(20, 12);
    ssd1306_WriteString("RT-Thread", Font_11x18, White);
    ssd1306_SetCursor(30, 36);
    {
        char ver[16];
        snprintf(ver, sizeof(ver), "v%d.%d.%d", RT_VERSION, RT_SUBVERSION, RT_REVISION);
        ssd1306_WriteString(ver, Font_7x10, White);
    }
    ssd1306_UpdateScreen(&hi2c1);
    rt_thread_mdelay(1500);
    ssd1306_Fill(Black);
    ssd1306_SetCursor(22, 20);
    ssd1306_WriteString("Init...", Font_11x18, White);
    ssd1306_UpdateScreen(&hi2c1);

    rt_thread_t tid;
    tid = rt_thread_create("sens", sensor_thread_entry, RT_NULL, 768,  8, 10);
    if (tid) rt_thread_startup(tid);
    tid = rt_thread_create("oled", oled_thread_entry,   RT_NULL, 896,  12, 10);
    if (tid) rt_thread_startup(tid);
    tid = rt_thread_create("keys", key_thread_entry,    RT_NULL, 384,  10, 10);
    if (tid) rt_thread_startup(tid);
    tid = rt_thread_create("shell", shell_thread_entry,  RT_NULL, 1024, 13, 10);
    if (tid) rt_thread_startup(tid);
    tid = rt_thread_create("esp",   esp_thread_entry,    RT_NULL, 896,  14, 10);
    if (tid) rt_thread_startup(tid);
    tid = rt_thread_create("game",  game_thread_entry,   RT_NULL, 640,   9, 10);
    if (tid) rt_thread_startup(tid);

#if AUTO_WIFI_ENABLE
    if (AUTO_WIFI_SSID[0] != '\0') {
        int ok = 1;
        rt_mutex_take(&i2c_mutex, RT_WAITING_FOREVER);
        ssd1306_Fill(Black);
        ssd1306_SetCursor(10, 24);
        ssd1306_WriteString("Auto WiFi...", Font_11x18, White);
        ssd1306_UpdateScreen(&hi2c1);
        rt_mutex_release(&i2c_mutex);

        strcpy(mqtt_ssid, AUTO_WIFI_SSID);
        strcpy(mqtt_pwd, AUTO_WIFI_PWD);
        esp_cmd = 1;
        rt_sem_release(&esp_go_sem);
        if (rt_sem_take(&esp_done_sem, AUTO_TIMEOUT_WIFI) != RT_EOK || esp_result != 0)
            ok = 0;

        rt_mutex_take(&i2c_mutex, RT_WAITING_FOREVER);
        ssd1306_Fill(Black);
        ssd1306_SetCursor(10, 24);
        ssd1306_WriteString(ok ? "WiFi OK!" : "WiFi FAIL", Font_11x18, White);
        ssd1306_UpdateScreen(&hi2c1);
        rt_mutex_release(&i2c_mutex);
        rt_thread_mdelay(ok ? 500 : 1500);

        if (!ok) goto boot_done;

#if AUTO_MQTT_ENABLE
        if (AUTO_MQTT_IP[0] != '\0') {
            ok = 1;
            rt_mutex_take(&i2c_mutex, RT_WAITING_FOREVER);
            ssd1306_Fill(Black);
            ssd1306_SetCursor(8, 24);
            ssd1306_WriteString("Auto MQTT...", Font_11x18, White);
            ssd1306_UpdateScreen(&hi2c1);
            rt_mutex_release(&i2c_mutex);

            strcpy(mqtt_broker, AUTO_MQTT_IP);
            strcpy(mqtt_port,   AUTO_MQTT_PORT);
            strcpy(mqtt_client, AUTO_MQTT_CLIENT);
            esp_cmd = 2;
            rt_sem_release(&esp_go_sem);
            if (rt_sem_take(&esp_done_sem, AUTO_TIMEOUT_MQTT) != RT_EOK || esp_result != 0)
                ok = 0;

            rt_mutex_take(&i2c_mutex, RT_WAITING_FOREVER);
            ssd1306_Fill(Black);
            ssd1306_SetCursor(8, 24);
            ssd1306_WriteString(ok ? "MQTT OK!" : "MQTT FAIL", Font_11x18, White);
            ssd1306_UpdateScreen(&hi2c1);
            rt_mutex_release(&i2c_mutex);
            rt_thread_mdelay(ok ? 500 : 1500);

            if (!ok) goto boot_done;
        }
#endif

#if AUTO_SUB_ENABLE
        if (AUTO_SUB_TOPIC[0] != '\0') {
            rt_mutex_take(&i2c_mutex, RT_WAITING_FOREVER);
            ssd1306_Fill(Black);
            ssd1306_SetCursor(5, 24);
            ssd1306_WriteString("Auto Sub...", Font_11x18, White);
            ssd1306_UpdateScreen(&hi2c1);
            rt_mutex_release(&i2c_mutex);

            strcpy(mqtt_topic, AUTO_SUB_TOPIC);
            esp_cmd = 4;
            rt_sem_release(&esp_go_sem);
            ok = (rt_sem_take(&esp_done_sem, AUTO_TIMEOUT_SUB) == RT_EOK && esp_result == 0);
            if (ok) { strncpy(mqtt_sub0, mqtt_topic, sizeof(mqtt_sub0)-1); mqtt_sub0_active = 1; }

            rt_mutex_take(&i2c_mutex, RT_WAITING_FOREVER);
            ssd1306_Fill(Black);
            ssd1306_SetCursor(5, 24);
            ssd1306_WriteString(ok ? "Sub OK!" : "Sub FAIL", Font_11x18, White);
            ssd1306_UpdateScreen(&hi2c1);
            rt_mutex_release(&i2c_mutex);
            rt_thread_mdelay(500);
        }
#endif
    }
boot_done:
    rt_mutex_take(&i2c_mutex, RT_WAITING_FOREVER);
    ssd1306_Fill(Black);
    ssd1306_UpdateScreen(&hi2c1);
    rt_mutex_release(&i2c_mutex);
#endif

    while (1) rt_thread_mdelay(1000);
    return RT_EOK;
}

/* ---- System Clock Configuration (called from board.c) ------------------- */

void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
    RCC_OscInitStruct.HSIState = RCC_HSI_ON;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
        Error_Handler();

    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                                  |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
        Error_Handler();
}

void Error_Handler(void)
{
    __disable_irq();
    while (1) {}
}
